/*
 ** 13장 연습문제
 * Q1) 지역 내부 클래스에서 외부 클래스 메서드의 지역 변수를 사용할 수 있지만, 그 값을 변경하면 오류가 발생합니다. 
 * 		이때 사용하는 지역변수는 [final] 변수가 되어 상수로 취급되기 때문입니다.
 * Q2) 내부 클래스 중 이름 없이 인터페이스나 추상 클래스 자료형에 직접 대입하여 생성하는 클래스를 [익명 클래스]라고합니다.
 * Q3) 자바에서 제공하는 함수형 프로그래밍 방식으로 인터페이스의 메서드를 직접 구현하는 코드를 [람다식] 이라고 합니다
 * Q4) 람다식으로 구현할 수 있는 인터페이스는 메서드를 하나만 가져야 합니다. 이러한 인터페이스를 [함수형 인터페이스]라고 합니다.
 * Q6) 자바에서 자료 처리를 추상화하여 여러 자료형의 자료를 동일하게 처리할 수 있도록 제공하는 클래스를 [스트림] 이라고 합니다.
*/

package practice10;

public class Q1toQ4Q6 {

}
