/*
 * 06장 연습문제
 * Q1) 클래스 내부에서 자신의 주소를 가리키는 예약어를  [this] 라고 합니다.
 * Q2) 클래스에 여러 생성자가 오버로드되어 있을 경우에 하나의 생성자에서 다른 생성자를 호출할 때 [this]를 사용합니다.
 * Q3) 클래스 내부에 선언하는 static 변수는 생성되는 인스턴스마다 만들어지는 것이 아닌 여러 인스턴스가 공유하는 변수입니다.
 * 		따라서 클래스에 기반한 유일한 변수라는 의미로 [클래스 변수] 라고도 합니다.
 * Q4) 지역 변수는 함수나 메서드 내부에서만 사용할 수 있고 [스택 메모리]에 생성됩니다.
 * 		멤버변수 중 static 예약어를 사용하는 static [데이터 영역] 메모리에 생성됩니다.
 * Q5) 아침 출근길에 김씨는 4000원을 내고 별다방에서 아메리카노를 샀습니다.
 * 		이씨는 콩다방에서 4500원을 내고 라뗴를 샀습니다. '06-2 객체간협력'을 참고해 이 과정을 객체지향으로 프로그래밍 하세요.
 * Q6) 카드 회사에서 카드를 발급할 떄마다 카드 고유 번호를 부여해 줍니다. 
 * 		06-3의 <학번 생성하기> 예제를 참고하여 카드 생성될 때마다 카드 번호가 자동으로 증가할 수 있는 카드 클래스를 만들고 번호를 생성해보세요.
 * Q7) Q6 구현 내용에 카드회사 클래스 CardCompany를 싱글턴 패턴으로 구현해보세요. 
*/

package singleton;

public class Practice1 {
	public static void main(String[] args) {
		
	}

}
